# IFCData Properties

---
The IFCData type exposes the following members.
| Name| Description
---|---|---
| HasValue|  Identifies if the data is empty or contains a value.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| PrimitiveType|  The primitive data type.
Top
#### Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace